//  Взявши за основу файл, який ми створили та разробляли під час уроку (з гіта, автоматичне тестування Mocha,Chai.html). 
//  Видаліть попередній функціонал та тести, та залишіть частину з підключенням бібліотек.
//  Зробіть все одним файлом для зручності.
//  Треба перевірити функцію додавання двох чисел. Треба написати наступні тести:
//  1. повинна правильно складати два числа
//  2. повинна працювати з негативними числами
//  3. повинна повертати число 
describe("sum",function(){
  it("cкладае два позитивних числа",function(){
    assert.equal(sum(3,3),6);
  });
  it("cкладае два негативних чисел",function(){
   assert.equal(sum(-3,-2),-5);
  });
  it("cкладае одне негативне та одне позитивне число",function(){
    assert.equal(sum(10,-2),8);
   });
   it("повертає число",function(){
    assert.typeOf(sum(3,3),"number");
   });
  
  });



  //test
  // describe("pow",function(){
  //   it("підносіть 2 до 3-го ступеня",function(){
  //     assert.equal(pow(2,3),8);
  //   });
  //   it("підносіть 3 до 2-го ступеня",function(){
  //     assert.equal(pow(3,2),9);
  //   });
  // });

  // describe("pow",function(){
  //   it("для від'ємного ступеня(n) результатом є NaN",function(){
  //     assert.isNaN(pow(3,-2));
  //   });
  //   it("для не цілого ступеня(n) результатом є NaN",function(){
  //     assert.isNaN(pow(3,5.5));
  //   });
  // });


