// ЗАГАЛЬНІ ПРАВИЛА:
// 1) Не модифікувати вхідні параметри!!!!

// 1.Напишіть функцію, яка приймає 2 рядки та порівнює їх
// довжину. Функція повертає 1, якщо в першому рядку
// більше символів, ніж у другому; -1 – якщо у другому більше символів, ніж у першому;
//  0 – якщо рядки однакової
// довжини. (length)
function lenghtStr(a,b){
  if(a.length > b.length){
    return 1;
  }else if(a.length === b.length){
    return 0;
  }else{
    return -1;
}}
console.log(lenghtStr('acook','cook88'));

let lenghtStr1 = (str1,str2) => {
  if(str1.length > str2.length)
    return 1;
  if(str1.length === str2.length)
      return 0;
  if(str1.length < str2.length)
    return -1;
}
console.log(lenghtStr1('absjj','asd'));
// 2. Напишіть функцію, яка переводить у верхній регістр перший символ переданого рядка.
// (toUpperCase, slice)
let ucFirst = (str) => {
     return str.at(0).toUpperCase() + str.slice(1,3);
   };
   console.log(ucFirst("abc"));
// 3. Напишіть функцію, яка підраховує кількість голосних
// літер у переданому рядку. (створити рядок з голосними літерами і шукати в ньому, includes) 

 function countToVowels(letters) {
     let vowels = 'aeiouyAEIOUYяиюэоаыуеЕУЫАОЭЯИЮ';
     let count = 0;

     for (let letter of letters) {
      if(vowels.includes(letter)){
        count += 1;
      } 
     }
     return count;
   }
   console.log(countToVowels('Привет Mary!'));

// 4. Напишіть функцію для перевірки спаму в переданому
// рядку. Функція повертає true, якщо рядок містить спам.
// Спамом вважати наступні слова: 100% безкоштовно,
// збільшення продажів, тільки сьогодні, не видаляйте, ххх. 
// Функція має бути нечутливою до регістру.
// (створити масив рідків зі спамом, toLowerCase, some, includes)
function identifySpam(str) {
  let spams = ['100% безкоштовно','збільшення продажів', 
              'тільки сьогодні', 'не видаляйте', 'ххх'];
  return spams.some(spam =>str.toLowerCase().includes(spam.toLowerCase()))
}
console.log(identifySpam('Tільки Сьогодні 100% Безкоштовно, приходьте'));
console.log(identifySpam('Приходьте ми поряд!'));
// 5. Напишіть функцію скорочення рядка. Функція приймає
// рядок та його максимальну довжину. Якщо довжина рядка більша, ніж максимальна, необхідно відкинути зайві
// символи, додавши замість них трикрапку. 
// Наприклад: truncate("Hello, world!", 8) має повернути "Hello...".(length, slice)

// 6. Напишіть функцію, яка перевіряє, чи є переданий рядок
// паліндромом. (split,reverse,join)
// 7. Напишіть функцію, яка підраховує кількість слів у реченні. (trim,split, length)
// 8. Напишіть функцію, яка повертає найдовше слово з речення.(split,reduce)
// 9. Напишіть функцію, яка підраховує середню довжину
// слова у реченні.(split,reduce)
// 10. Напишіть функцію, яка приймає рядок і символ і виводить
// індекси, за якими знаходиться цей символ у рядку. Також
// виведіть, скільки разів зустрічається цей символ у рядку(psuh,length)